In [8]:
import pandas as pd
import numpy as np

raw_data = {'team': ['Ten Snakes', 'Ten Snakes', 'Ten Snakes', 'Ten Snakes', 
                                    'Nine Monkeys', 'Nine Monkeys', 'Nine Monkeys', 'Nine Monkeys', 
                                    'Eight Eagles', 'Eight Eagles'], 
        'rank': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '2nd'], 
        'name': ['James', 'Allen', 'Matthew', 'James', 'Devon', 'Sam', 'Justin', 'Sam', 'Paul', 'Ross'], 
        'score1': [16,35,55,29,2,61,68,41,94,18],
        'score2': [81,65,54,44,28,93,2,5,53,99]}
df = pd.DataFrame(raw_data, columns = ['team', 'rank', 'name', 'score1', 'score2'])
df

           team rank     name  score1  score2
0    Ten Snakes  1st    James      16      81
1    Ten Snakes  1st    Allen      35      65
2    Ten Snakes  2nd  Matthew      55      54
3    Ten Snakes  2nd    James      29      44
4  Nine Monkeys  1st    Devon       2      28
5  Nine Monkeys  1st      Sam      61      93
6  Nine Monkeys  2nd   Justin      68       2
7  Nine Monkeys  2nd      Sam      41       5
8  Eight Eagles  1st     Paul      94      53
9  Eight Eagles  2nd     Ross      18      99

In [6]:
grouped = df.groupby('team')

In [7]:
list(grouped)

[('Eight Eagles',
             team rank  name  score1  score2
  8  Eight Eagles  1st  Paul      94      53
  9  Eight Eagles  2nd  Ross      18      99),
 ('Nine Monkeys',
             team rank    name  score1  score2
  4  Nine Monkeys  1st   Devon       2      28
  5  Nine Monkeys  1st     Sam      61      93
  6  Nine Monkeys  2nd  Justin      68       2
  7  Nine Monkeys  2nd     Sam      41       5),
 ('Ten Snakes',
           team rank     name  score1  score2
  0  Ten Snakes  1st    James      16      81
  1  Ten Snakes  1st    Allen      35      65
  2  Ten Snakes  2nd  Matthew      55      54
  3  Ten Snakes  2nd    James      29      44)]

In [10]:
grouped.describe()

             score1                                                   score2  \
              count   mean        std   min    25%   50%    75%   max  count
team
Eight Eagles    2.0  56.00  53.740115  18.0  37.00  56.0  75.00  94.0    2.0
Nine Monkeys    4.0  43.00  29.631065   2.0  31.25  51.0  62.75  68.0    4.0
Ten Snakes      4.0  33.75  16.235250  16.0  25.75  32.0  40.00  55.0    4.0


              mean        std   min    25%   50%    75%   max
team
Eight Eagles  76.0  32.526912  53.0  64.50  76.0  87.50  99.0
Nine Monkeys  32.0  42.292631   2.0   4.25  16.5  44.25  93.0
Ten Snakes    61.0  15.853496  44.0  51.50  59.5  69.00  81.0

In [11]:
grouped.mean()

              score1  score2
team
Eight Eagles   56.00    76.0
Nine Monkeys   43.00    32.0
Ten Snakes     33.75    61.0

In [12]:
grouped.size()

team
Eight Eagles    2
Nine Monkeys    4
Ten Snakes      4
dtype: int64

In [13]:
grouped.count()

              rank  name  score1  score2
team
Eight Eagles     2     2       2       2
Nine Monkeys     4     4       4       4
Ten Snakes       4     4       4       4

In [14]:
df2 = df.set_index(['team','rank'])
df2

                      name  score1  score2
team         rank
Ten Snakes   1st     James      16      81
             1st     Allen      35      65
             2nd   Matthew      55      54
             2nd     James      29      44
Nine Monkeys 1st     Devon       2      28
             1st       Sam      61      93
             2nd    Justin      68       2
             2nd       Sam      41       5
Eight Eagles 1st      Paul      94      53
             2nd      Ross      18      99

In [15]:
grouped2 = df2.groupby(level=['team', 'rank'])

In [17]:
grouped2.mean()

                   score1  score2
team         rank
Eight Eagles 1st     94.0    53.0
             2nd     18.0    99.0
Nine Monkeys 1st     31.5    60.5
             2nd     54.5     3.5
Ten Snakes   1st     25.5    73.0
             2nd     42.0    49.0

In [19]:
grouped.agg(np.sum)

              score1  score2
team
Eight Eagles     112     152
Nine Monkeys     172     128
Ten Snakes       135     244

In [21]:
grouped2.agg(np.sum)

                   score1  score2
team         rank
Eight Eagles 1st       94      53
             2nd       18      99
Nine Monkeys 1st       63     121
             2nd      109       7
Ten Snakes   1st       51     146
             2nd       84      98

In [22]:
def f(x):
    m = x.mean()
    return (m.score1 > 50) & (m.score2 > 50)

grouped.filter(f)

  rank  name  score1  score2
8  1st  Paul      94      53
9  2nd  Ross      18      99